Revit 2027 API
ExportIFCCategoryInfo.IFCExportFlag Property
 The boolean value that indicates whether the category is exported to IFC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IFCExportFlag { get; set; }
Public Property IFCExportFlag As Boolean
	Get
	Set
public:
property bool IFCExportFlag {
	bool get ();
	void set (bool value);
}
member IFCExportFlag : bool with get, set
Property Value
Boolean
See Also
Reference
ExportIFCCategoryInfo Class
Autodesk.Revit.DB Namespace